//**************************************************
// 
// game.cpp
// Author  : katsuki mizuki
// 
//**************************************************

//==================================================
// インクルード
//==================================================
#include "game.h"
#include "input.h"
#include "application.h"
#include "fade.h"
#include "time.h"

//==================================================
// 定義
//==================================================
namespace
{
}

//--------------------------------------------------
// デフォルトコンストラクタ
//--------------------------------------------------
CGame::CGame()
{
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
CGame::~CGame()
{
}

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void CGame::Init()
{
	{// 背景
		CObject2D* pObj = CObject2D::Create();

		float width = (float)CApplication::SCREEN_WIDTH;
		float height = (float)CApplication::SCREEN_HEIGHT;

		// 位置の設定
		pObj->SetPos(D3DXVECTOR3(width * 0.5f, height * 0.5f, 0.0f));

		// サイズの設定
		pObj->SetSize(D3DXVECTOR3(width, height, 0.0f));

		// 色の設定
		pObj->SetCol(D3DXCOLOR(0.75f, 0.75f, 0.75f, 1.0f));

		// テクスチャの設定
		//pObj->SetTexture(CTexture::LABEL_TITLE_BG);
	}

	// タイムの生成
	CTime::Create();
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void CGame::Uninit()
{
	// 解放
	Release();
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void CGame::Update()
{
	// 入力
	Input();
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void CGame::Draw()
{
}

//--------------------------------------------------
// 入力
//--------------------------------------------------
void CGame::Input()
{
	CInput* pInput = CInput::GetKey();

	if (pInput->Trigger(KEY_DECISION))
	{
		// モードの変更
		CApplication::GetInstance()->GetFade()->ChangeMode(EMode::MODE_TITLE);
	}
}
